#Оленка дізналася, що їй для сну треба t хвилин.
#На відміну від Тетяни, Оленка лягає спати після
#опівночі в h годин і m хвилин. Допоможіть Оленці
#визначити, на який час їй поставити будильник, щоб
#він продзвенів рівно через t хвилин після того, як
#вона ляже спати. В окремомих рядках вводяться значення
#t, h і m відповідно. Гарантується, що Оленка повинна
#прокинутися в той же день, що і заснути.
#Програма повинна виводити час, на який потрібно поставити будильник:
#в першому рядку години, в другому - хвилини.
t = int(input("Введіть скільки хвилин для сну: "))
h = int(input("Введіть в скільки годин лягаєте: "))
m = int(input("Введіть в скільки хвилин лягаєте "))
a=t/60
b=t%60
c=a+h
d=b+m
print("Будильник потрібно ставити на " f"{c:.0f}"" годин")
print( f"{d} хвилин")
